cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233H6PM.svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSEXC</name>
      <description>Register map for SYSEXC peripheral</description>
      <groupName>SYSEXC</groupName>
      <prependToName>SYSEXC</prependToName>
      <baseAddress>0x400F9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>SYSEXC</name><value>106</value></interrupt>
      <registers>
        <register>
          <name>RIS</name>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_RIS_FPIDCRIS</name>
              <description>Floating-Point Input Denormal Exception Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPDZCRIS</name>
              <description>Floating-Point Divide By 0 Exception Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIOCRIS</name>
              <description>Floating-Point Invalid Operation Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPUFCRIS</name>
              <description>Floating-Point Underflow Exception Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPOFCRIS</name>
              <description>Floating-Point Overflow Exception Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIXCRIS</name>
              <description>Floating-Point Inexact Exception Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>System Exception Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_IM_FPIDCIM</name>
              <description>Floating-Point Input Denormal Exception Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPDZCIM</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIOCIM</name>
              <description>Floating-Point Invalid Operation Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPUFCIM</name>
              <description>Floating-Point Underflow Exception Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPOFCIM</name>
              <description>Floating-Point Overflow Exception Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIXCIM</name>
              <description>Floating-Point Inexact Exception Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>System Exception Masked Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_MIS_FPIDCMIS</name>
              <description>Floating-Point Input Denormal Exception Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPDZCMIS</name>
              <description>Floating-Point Divide By 0 Exception Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIOCMIS</name>
              <description>Floating-Point Invalid Operation Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPUFCMIS</name>
              <description>Floating-Point Underflow Exception Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPOFCMIS</name>
              <description>Floating-Point Overflow Exception Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIXCMIS</name>
              <description>Floating-Point Inexact Exception Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>System Exception Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSEXC_IC_FPIDCIC</name>
              <description>Floating-Point Input Denormal Exception Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPDZCIC</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIOCIC</name>
              <description>Floating-Point Invalid Operation Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPUFCIC</name>
              <description>Floating-Point Underflow Exception Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPOFCIC</name>
              <description>Floating-Point Overflow Exception Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIXCIC</name>
              <description>Floating-Point Inexact Exception Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
